{
  "bug_report": "Hi {name},\n\nThank you for reporting this issue! I'm sorry you're experiencing problems with FitTrack.\n\nI've logged your bug report and our team is investigating. We take these reports seriously and will work on a fix as quickly as possible.\n\nIn the meantime, here are a few troubleshooting steps you can try:\n1. Try refreshing the app or logging out and back in\n2. Make sure you're running the latest version\n3. Clear your app cache if possible\n\nI'll keep you updated on our progress. If you have any additional details about when this happens or steps to reproduce it, please let me know!\n\nThanks for your patience,\nRoss\nFitTrack Support",
  
  "feature_request": "Hi {name},\n\nThank you for your feature suggestion! I really appreciate you taking the time to share your ideas.\n\nI've added your request to our product roadmap. We're a small team, but we're always looking to improve FitTrack based on user feedback like yours.\n\nWhile I can't guarantee when (or if) this feature will be added, I can tell you that user requests heavily influence our development priorities. The more people ask for something, the higher priority it becomes!\n\nIs there anything else you'd like to see in FitTrack?\n\nThanks again for being a great user,\nRoss\nFitTrack Support",
  
  "payment_issue": "Hi {name},\n\nI'm sorry you're having payment issues. Let me help you resolve this right away.\n\nI've checked your account and can see the issue. Here's what we can do:\n\n1. If you'd like to update your payment method, you can do so in Settings → Billing\n2. If you'd like a refund, I'm happy to process that immediately\n3. If you're having trouble with the billing process, I can walk you through it\n\nPayment issues are frustrating, and I want to make sure this gets resolved quickly. Just let me know what works best for you!\n\nBest regards,\nRoss\nFitTrack Support",
  
  "how_to": "Hi {name},\n\nGreat question! I'm happy to help you with this.\n\nHere's how to do what you're looking for:\n\n[Instructions would go here - this template needs customization based on the specific question]\n\nIf you need more detailed help or have any other questions, feel free to reply to this email. I'm also working on better tutorials and documentation to make FitTrack easier to use.\n\nIs there anything else I can help you with?\n\nBest,\nRoss\nFitTrack Support",
  
  "cancellation": "Hi {name},\n\nI'm sorry to see you go! Before I process your cancellation, I wanted to check if there's anything we can do to improve your experience with FitTrack.\n\nIf there's a specific issue or missing feature that's causing you to cancel, I'd love to hear about it. Your feedback helps us improve!\n\nSome options to consider:\n- Would a different plan work better for you?\n- Is there a feature you need that we don't have?\n- Did you run into any technical issues?\n\nIf you'd still like to cancel, I completely understand and will process that immediately. Just confirm and I'll take care of it.\n\nThanks for trying FitTrack,\nRoss\nFitTrack Support",
  
  "positive_feedback": "Hi {name},\n\nThank you so much for the kind words! Messages like yours absolutely make my day.\n\nI'm thrilled that FitTrack is helping you reach your fitness goals. That's exactly why I built it!\n\nIf you're enjoying the app, would you mind leaving a review or sharing it with friends who might benefit? Word of mouth from awesome users like you is the best way to help FitTrack grow.\n\nThanks again for your support!\n\nBest,\nRoss\nFitTrack",
  
  "general_inquiry": "Hi {name},\n\nThank you for reaching out! I'd be happy to help you with your question.\n\nCould you provide a bit more detail about what you're looking for? That way I can give you the most helpful response.\n\nI typically respond within 24 hours (often much faster), so you'll hear back from me soon!\n\nBest,\nRoss\nFitTrack Support",
  
  "data_request": "Hi {name},\n\nThank you for your data export request. Your privacy is important to us.\n\nI've generated a full export of your FitTrack data and attached it to this email. This includes:\n- All your logged meals and macros\n- Workout history\n- Account information\n- Progress data\n\nYour data is in JSON format for easy importing to other tools. If you need it in a different format, just let me know!\n\nIs there anything else I can help you with?\n\nBest,\nRoss\nFitTrack Support",
  
  "account_issue": "Hi {name},\n\nI'm sorry you're having trouble accessing your account. Let's get this fixed right away.\n\nHere are a few things to try:\n1. Reset your password using the \"Forgot Password\" link\n2. Make sure you're using the correct email address\n3. Check if your account might have been locked for security reasons\n\nIf none of these work, reply to this email with:\n- The email address you signed up with\n- When you last successfully logged in\n- Any error messages you're seeing\n\nI'll personally investigate and get your account working again ASAP.\n\nBest,\nRoss\nFitTrack Support",
  
  "integration_request": "Hi {name},\n\nThanks for your suggestion about integrating with {subject}!\n\nIntegrations are definitely on our roadmap. Right now we're focusing on making the core FitTrack experience as good as possible, but we're planning to add integrations in the future.\n\nI've added your specific request to our integration wishlist. When we start building integrations, requests with the most votes get priority!\n\nIn the meantime, you can export your data from FitTrack (Settings → Export) and import it manually if needed.\n\nThanks for being a part of FitTrack!\n\nBest,\nRoss\nFitTrack",
  
  "trial_expiring": "Hi {name},\n\nI noticed your FitTrack trial is ending soon, and I wanted to personally reach out!\n\nHow has your experience been so far? I'd love to hear what you think - both what's working and what could be better.\n\nIf you're ready to continue using FitTrack, you can upgrade to a paid plan anytime in Settings. And if you have any questions about the plans or features, just reply to this email!\n\nThanks for trying FitTrack,\nRoss\nFitTrack",
  
  "refund_request": "Hi {name},\n\nI'm sorry FitTrack didn't meet your expectations. I've processed your refund immediately - you should see it in 3-5 business days.\n\nIf you're open to sharing, I'd really appreciate knowing what didn't work for you. Your feedback helps me improve FitTrack for future users.\n\nRefund details:\n- Amount: [automatically filled]\n- Processing time: 3-5 business days\n- Method: Original payment method\n\nSorry we couldn't meet your needs this time!\n\nBest,\nRoss\nFitTrack",
  
  "technical_support": "Hi {name},\n\nI'm sorry you're running into technical difficulties. Let's get this sorted out!\n\nTo help me diagnose the issue, could you provide:\n1. What device and operating system you're using\n2. What exactly happens when the issue occurs\n3. Any error messages you see\n4. When this started happening\n\nThe more details you can provide, the faster I can fix this for you!\n\nIn the meantime, try:\n- Restarting the app\n- Updating to the latest version\n- Checking your internet connection\n\nI'll be standing by for your response.\n\nBest,\nRoss\nFitTrack Support"
}
